Revit 2026 API

# AssemblyInstanceCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static AssemblyInstance Create(
	Document document,
	ICollection<ElementId> assemblyMemberIds,
	ElementId namingCategoryId
)
```
```vb
Public Shared Function Create (
	document As Document,
	assemblyMemberIds As ICollection(Of ElementId),
	namingCategoryId As ElementId
) As AssemblyInstance
```
```cpp
public:
static AssemblyInstance^ Create(
	Document^ document,
	ICollection<ElementId^>^ assemblyMemberIds,
	ElementId^ namingCategoryId
)
```
```fsharp
static member Create :
        document : Document *
        assemblyMemberIds : ICollection<ElementId> *
        namingCategoryId : ElementId -> AssemblyInstance
```

#### Parameters

document Document

assemblyMemberIds ICollectionElementId

namingCategoryId ElementId

#### Return Value

AssemblyInstance

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace